var cities = [{
  "name": "北京",
  "id": "108288"
},
{
  "name": "上海",
  "id": "108296"
},
{
  "name": "广州",
  "id": "118281"
},
{
  "name": "武汉",
  "id": "118254"
},
{
  "name": "深圳",
  "id": "118282"
},
{
  "name": "成都",
  "id": "118318"
},
{
  "name": "杭州",
  "id": "118172"
},
{
  "name": "南京",
  "id": "118159"
},
{
  "name": "西安",
  "id": "118371"
},
{
  "name": "重庆",
  "id": "108309"
},
{
  "name": "郑州",
  "id": "118237"
},
{
  "name": "长沙",
  "id": "118267"
},
{
  "name": "天津",
  "id": "108289"
},
{
  "name": "福州",
  "id": "118200"
},
{
  "name": "苏州",
  "id": "118163"
},
{
  "name": "沈阳",
  "id": "118123"
},
{
  "name": "温州",
  "id": "118174"
},
{
  "name": "哈尔滨",
  "id": "118146"
},
{
  "name": "青岛",
  "id": "118221"
},
{
  "name": "济南",
  "id": "118220"
},
{
  "name": "大连",
  "id": "118124"
},
{
  "name": "厦门",
  "id": "118201"
},
{
  "name": "长春",
  "id": "118137"
},
{
  "name": "宁波",
  "id": "118173"
},
{
  "name": "合肥",
  "id": "118183"
},
{
  "name": "石家庄",
  "id": "118088"
},
{
  "name": "昆明",
  "id": "118348"
},
{
  "name": "无锡",
  "id": "118160"
},
{
  "name": "南昌",
  "id": "118209"
},
{
  "name": "泉州",
  "id": "118204"
},
{
  "name": "东莞",
  "id": "118297"
},
{
  "name": "南宁",
  "id": "118302"
},
{
  "name": "太原",
  "id": "118099"
},
{
  "name": "佛山",
  "id": "118286"
},
{
  "name": "常州",
  "id": "118162"
},
{
  "name": "台州",
  "id": "118181"
},
{
  "name": "徐州",
  "id": "118161"
},
{
  "name": "金华",
  "id": "118178"
},
{
  "name": "烟台",
  "id": "118226"
},
{
  "name": "汕头",
  "id": "118284"
},
{
  "name": "贵阳",
  "id": "118339"
},
{
  "name": "兰州",
  "id": "118381"
},
{
  "name": "香港",
  "id": "108090"
},
{
  "name": "保定",
  "id": "118093"
},
{
  "name": "珠海",
  "id": "118283"
},
{
  "name": "乌鲁木齐",
  "id": "118408"
},
{
  "name": "嘉兴",
  "id": "118175"
},
{
  "name": "洛阳",
  "id": "118239"
},
{
  "name": "绍兴",
  "id": "118177"
},
{
  "name": "南通",
  "id": "118164"
},
{
  "name": "潍坊",
  "id": "118225"
},
{
  "name": "唐山",
  "id": "118089"
},
{
  "name": "海口",
  "id": "118316"
},
{
  "name": "临沂",
  "id": "118232"
},
{
  "name": "惠州",
  "id": "118291"
},
{
  "name": "扬州",
  "id": "118168"
},
{
  "name": "桂林",
  "id": "118304"
},
{
  "name": "淄博",
  "id": "118222"
},
{
  "name": "中山",
  "id": "118298"
},
{
  "name": "呼和浩特",
  "id": "118111"
},
{
  "name": "济宁",
  "id": "118228"
},
{
  "name": "江门",
  "id": "118287"
},
{
  "name": "邯郸",
  "id": "118091"
},
{
  "name": "柳州",
  "id": "118303"
},
{
  "name": "吉林",
  "id": "129059"
},
{
  "name": "秦皇岛",
  "id": "118090"
},
{
  "name": "盐城",
  "id": "118167"
},
{
  "name": "芜湖",
  "id": "118184"
},
{
  "name": "绵阳",
  "id": "118323"
},
{
  "name": "银川",
  "id": "118403"
},
{
  "name": "揭阳",
  "id": "118300"
},
{
  "name": "宜昌",
  "id": "118259"
},
{
  "name": "鞍山",
  "id": "118125"
},
{
  "name": "赣州",
  "id": "118215"
},
{
  "name": "连云港",
  "id": "118165"
},
{
  "name": "湛江",
  "id": "118288"
},
{
  "name": "威海",
  "id": "118227"
},
{
  "name": "台北",
  "id": "119088"
},
{
  "name": "沧州",
  "id": "118096"
},
{
  "name": "大庆",
  "id": "118151"
},
{
  "name": "新乡",
  "id": "118243"
},
{
  "name": "镇江",
  "id": "118169"
},
{
  "name": "漳州",
  "id": "118205"
},
{
  "name": "运城",
  "id": "118107"
},
{
  "name": "泰州",
  "id": "118170"
},
{
  "name": "邢台",
  "id": "118092"
},
{
  "name": "湖州",
  "id": "118176"
},
{
  "name": "泰安",
  "id": "118229"
},
{
  "name": "莆田",
  "id": "118202"
},
{
  "name": "南阳",
  "id": "118249"
},
{
  "name": "衡阳",
  "id": "118270"
},
{
  "name": "荆州",
  "id": "118258"
},
{
  "name": "襄樊",
  "id": "118256"
},
{
  "name": "淮安",
  "id": "118166"
},
{
  "name": "茂名",
  "id": "118289"
},
{
  "name": "株洲",
  "id": "118268"
},
{
  "name": "包头",
  "id": "118112"
},
{
  "name": "潮州",
  "id": "118299"
},
{
  "name": "大同",
  "id": "118100"
},
{
  "name": "九江",
  "id": "118212"
}];
cities.name2id = {};
cities.id2name = {};

cities.forEach(function(item) {
  cities.name2id[item['name']] = item['id'];
  cities.id2name[item['id']] = item['name'];
});

module.exports = cities;
