module.exports = {
	'cities': require('./cities'),
	'messages': require('./messages'),
	'types': {
		//"1001": "小型现场|live",
		//"1002": "音乐会",
		//"1003": "演唱会",
		//"1004": "音乐节",
		//"1101": "话剧",
		//"1102": "音乐剧",
		//"1103": "舞剧",
		//"1104": "歌剧",
		//"1105": "戏曲",
		//"1401": "生活",
		//"1402": "集市",
		//"1403": "摄影",
		//"1404": "外语",
		//"1405": "桌游",
		//"1406": "夜店",
		//"1407": "交友",
		//"1801": "主题放映",
		//"1802": "影展",
		//"1803": "影院活动",
		"all": "所有",
		"salon": "讲座|沙龙",
		"others": "其他",
		"film": "电影|观影",
		"commonweal": "公益",
		"travel": "旅行|旅游",
		"sports": "运动|体育",
		"drama": "戏剧|舞台剧",
		"music": "音乐|演出",
		"exhibition": "展览",
		"party": "聚会|约会"
  },
  'day_types': {
    'future': '近期|将来',
    'week': '最近一周|本周|最近|一周',
    'weekend': '周末',
    'today': '今天|今日',
    'tomorrow': '明天|明日'
  }
};

